#+title: LastPass on the command line
#+date: 2021-12-17
#+draft: true

https://github.com/lastpass/lastpass-cli

* Install

OSX:

#+begin_src bash
  brew install lastpass-cli
#+end_src

Debian:

#+begin_src bash

#+end_src

* Login
#+begin_src bash
  lpass login wschenk@gmail.com
#+end_src

* Show

#+begin_src bash :results output
lpass show Tesla --user
#+end_src

#+RESULTS:
: will@happyfuncorp.com
